Tekla.Structures.Filtering.DateTimeFilterExpression
The DateTimeFilterExpression class represents a DateTime filter expression.

Tekla.Structures.Filtering.DateTimeFilterExpression.#ctor(System.String)
Initializes a new instance of the DateTimeFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.DateTimeFilterExpression.#ctor(System.String,System.String,System.String,System.String)
Initializes a new instance of the DateTimeFilterExpression class.
Name: The name of the expression.
Category: The category of the expression.
Property: The property of the expression.
LocalizationKey: The localization key of the expression.